"""
Написать функцию host_range_ping_tab(), возможности которой основаны на функции из примера 2.
Но в данном случае результат должен быть итоговым по всем ip-адресам, представленным
в табличном формате (использовать модуль tabulate). Таблица должна состоять из двух колонок
"""


from tabulate import tabulate
from Task_2 import host_range_ping

def host_range_ping_tab():
    result_dict = host_range_ping()
    print(tabulate([result_dict], headers='keys', tablefmt="pipe", stralign="center"))


if __name__ == '__main__':
    host_range_ping_tab()

"""
Введите адрес с которого начать: 192.168.100.1
Сколько адресов проверяем?: 10
Узел доступен: 192.168.100.1
 192.168.100.4
 192.168.100.5
 192.168.100.8
 
Узел недоступен: 192.168.100.2
 192.168.100.3
 192.168.100.6
 192.168.100.7
 192.168.100.9
 192.168.100.10
 
 
|  Узел доступен  |  Узел недоступен  |
|:---------------:|:-----------------:|
|  192.168.100.1  |   192.168.100.2   |
|  192.168.100.4  |   192.168.100.3   |
|  192.168.100.5  |   192.168.100.6   |
|  192.168.100.8  |   192.168.100.7   |
|                 |   192.168.100.9   |
|                 |   192.168.100.10  |
"""
